In [1]:
import numpy as np
import pandas as pd

# MemberShip of a value

In [2]:
data = {'Rollno': [101, 102, 105, 109], 'Name': ['abc', 'xyz', 'pqr', 'lmn'], 'Percent': [85.6, 77.8, 98.6, 72.3]}

In [3]:
myframe = pd.DataFrame(data)

In [4]:
data

{'Rollno': [101, 102, 105, 109],
 'Name': ['abc', 'xyz', 'pqr', 'lmn'],
 'Percent': [85.6, 77.8, 98.6, 72.3]}

In [5]:
myframe

   Rollno Name  Percent
0     101  abc     85.6
1     102  xyz     77.8
2     105  pqr     98.6
3     109  lmn     72.3

In [6]:
myframe = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])

In [7]:
myframe

   Rollno Name  Percent
a     101  abc     85.6
b     102  xyz     77.8
c     105  pqr     98.6
d     109  lmn     72.3

In [8]:
myframe.isin([105])

   Rollno   Name  Percent
a   False  False    False
b   False  False    False
c    True  False    False
d   False  False    False

In [9]:
myframe.isin([105, 'xyz'])

   Rollno   Name  Percent
a   False  False    False
b   False   True    False
c    True  False    False
d   False  False    False

# Deleting a column

In [10]:
myframe.head()

   Rollno Name  Percent
a     101  abc     85.6
b     102  xyz     77.8
c     105  pqr     98.6
d     109  lmn     72.3

In [11]:
del myframe['Percent']

In [12]:
myframe

   Rollno Name
a     101  abc
b     102  xyz
c     105  pqr
d     109  lmn

# Filtering

In [13]:
myframe[myframe.Rollno > 102]

   Rollno Name
c     105  pqr
d     109  lmn

# DataFrame from nested dictionary

In [14]:
nestdict = {'red':{2012: 22, 2013: 33}, 'white':{2011: 13, 2012: 22, 2013: 16}, 'blue': {2011: 17, 2012: 27, 2013: 18}}

In [16]:
nest_dframe = pd.DataFrame(nestdict)
nest_dframe

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17

# Transposition of a DataFrame

In [17]:
myframe

   Rollno Name
a     101  abc
b     102  xyz
c     105  pqr
d     109  lmn

In [18]:
myframe.T

          a    b    c    d
Rollno  101  102  105  109
Name    abc  xyz  pqr  lmn